# from decimal import Decimal
#
# # Стандартные числа с плавающей запятой
# i = 3.3 + 4.1
# print(i)
# # Вывод в терминал: 7.3999999999999995
#
# # Использование модуля Decimal для точных вычислений
# i = Decimal('3.3') + Decimal('4.1')
# print(i)
# # Вывод в терминал: 7.4
# #-------------------------------------------------
# rating = 4.9
#
# # Используем стандартный оператор if...else
# if rating > 4.7:
#     print('Фильм крут')
# else:
#     print('Так себе киношечка')
#
# # Используем тернарный оператор
# result = 'Фильм крут' if rating > 4.7 else 'Так себе киношечка'
# print(result)
#
# print('Проверка окончена')
# #-------------------------------------------------
x = -1
y = -4
cuoter = 0

if x and y > 0:
    cuoter = 1
elif x < 0 and y > 0:
    cuoter = 2
elif x < 0 and y < 0:
    cuoter = 3
elif x > 0 and y < 0:
    cuoter = 4
print('точка в четверти', cuoter)